command_list = {
}

app_list = {
    "chromium": ["хромиум", "браузер"],
    "google-chrome-stable": ["хром", "гугл"],
    "pycharm": ["питон"],
    "code": ["студия"],
    "Telegram": ["телеграм", "телега"],
    "discord": ["дискорд"],
    "endeavour": ["задачи", "планировщик"],
    "kgx": ["терминал", "командная", "строка"],
    "gnome-calculator": ["калькулятор"],
    "dolphin": ["менеджер", "каталог"],
    "kdeconnect-app": ["андроид"]
}


# открыть + новый + вкладка/окно
# открыть/закрыть + история/следующий/предыдущий/(закрытый + вкладка)
browser_list = {
    "новое": ["новый"],
    "вкладка": ["вкладка"],
    "окно": ["окно"],
    "история": ["история"],
    "закрытый": ["закрытый"],
    "следующий": ["следующий"],
    "предыдущий": ["предыдущий"],
}

# sound,
system_list = {
    "звук": ["звук", "громкость"],
    "включить": ["включить", "подрубить"],
    "выключить": ["выключить", "заглушить"],
    "тише": ["тихо", "тише", "приглушить", "приглуши"],
    "громче": ["громче", "увеличь"],
}

app_execute_list = {
    "открыть": ["открыть"],
    "закрыть": ["закрыть", "завершить"],
}

hot_keys_list = {
    "desktop1": ["рабочий стол один"], # super + 1
    "desktop2": ["рабочий стол два"], # super + 2
    "desktop3": ["рабочий стол три"], # super + 3
    "свернуть": ["свернуть"], # super + h
    "закрыть": [], # alt + super + c
    "следующий": ["следующий"], # alt + tab
    "предыдущий": ["предыдущий"], # super + tab
    "уведомления": ["уведомление"],
    "отмена": ["отмена"],
    "базаданных": ["база"] # pgadmin4 & sleep 3 && chromium http://127.0.0.1:5050
}

command_list.update(app_list)
command_list.update(app_execute_list)
command_list.update(browser_list)
command_list.update(system_list)
command_list.update(hot_keys_list)